<?php

namespace Modules\Freelancer\Http\Controllers\ContractText;

use Illuminate\Http\Request;
use Illuminate\Routing\Controller;
use Modules\FileLibrary\Http\Controllers\FileLibraryController;
use Modules\Freelancer\Entities\Freelancer;

class AcceptRulesContractTextController extends Controller
{
    /*
    * Get Data
    * Route: /api/my-account/accept-rules
    * GET
    * */
    static public function ContractText()
    {
        $Contract = "
        <div dir='rtl' style='font-size: 10pt; font-size: 15px; line-height: 2.5;'>
            <div style='text-align: center; font-weight: bold; margin-bottom: 50px; font-size: 17px'>قوانین و مقررات اپلیکیشن EIED+</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>این متن بعنوان قرارداد و موافقتنامه الزام آور «EIED+» فیمابین هر یک از کاربران (اشخاص حقیقی و یا حقوقی) (USERS) و صاحبان کسب و کار که در ماده 1 قید شده است می باشد که تماما بر اساس قوانین و مقررات جمهوری اسلامی ایران تدوین گردیده است. برخی از مفاد قرارداد حاضر، ضرورتا در قوانین جاری پیشبینی نشده است اما داخل در توافقات طرفین به صورت مشروع و مطابق با قانون، الزام آور است. عدم پذیرش قرارداد، به منزله عدم تمایل کاربر به استفاده از اپلیکیشن و سایت میباشد و پذیرش آن به منزله انعقاد قرارداد به صورت تام و تمام و مطلق است و تمامی کاربران در هر نقشی متعهد به رعایت کلیه مفاد قرارداد خواهند بود. لذا در مطالعه جزییات آن دقت فرمایید.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>کاربران محترم  “EIED+” توجه فرمایند که شرایط عمومی حاضر و کلیه روابط فیمابین، تماما بر اساس قوانین جاری کشور ایران میباشد. طرفین، خارج از حوزه مندرجات قرارداد نیز موظف و متعهد به اجرای قوانین میباشند. لذا در صورت تغییر قوانین جاری یا نسخ آنها و یا مرور زمان اجرای آنها، به گونه ای که نیازمند تغییر در متن قرارداد حاضر و سایر روابط قانونی فیمابین گردد و یا اینکه  “EIED+” تشخیص دهد برخی از جزئیات توافق، خلاف نظم عمومی و یا خلاف عرف تجاری است و یا تغییر تعهدات منجر به تسهیل روابط قراردادی گردد، اصول جدید جایگزین اصول قبلی این قرارداد میگردد و در همین صفحه به روز رسانی خواهد شد و کاربران توافق نموده اند که استفاده مستمر از سایت و اپلیکیشن به معنی پذیرش هرگونه تغییر است.</div>

            <div style='margin-top: 40px; font-weight: bold'>1- طرفین قرارداد</div>
            <div style='margin-top: 40px; font-weight: bold'>1.1 طرف اول قرارداد</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>این قرارداد بر اساس ماده ۱۰ قانون مدنی و به صورت دوجانبه و مطابق مفاد و شرایط این سند، میان طرفین آن منعقد می‌شود: طرف اول قرارداد اپلیکیشن EIED+ به نشانی اینترنتی https://plus.eied.comو تمامی سرویس‌ها، ابزارها، اپلیکیشن‌ها و سایر وب‌سایت‌ها و دامنه‌ها و نشان‌های تجاری وابسته به آن است که از این پس در این سند «EIED+»‌ نامیده می‌شود.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>تبصره ۱: اپلیکیشن EIED+ را شرکت «طراحی و مهندسی صنایع انرژی (سهامی خاص)» مدیریت می‌کند که در تاریخ 05 مرداد 1376 به شماره ثبت 140735 و شناسه ملی 10101837663 تأسیس شده است. تبصره ۲: اپلیکیشن  “EIED+” یک بازار برخط است و نقش ایجاد زیرساخت مناسب برای تعامل میان مهندسین در رشته های مختلف مهندسی نفت و گاز هستند را برعهده دارد. به عبارت دیگر EIED+ نقش کارفرمای پروژه  است و متقاضیان در آن بستر به عنوان پیمانکار مشغول به کار خواهند بود.</div>
            <div style='margin-top: 40px; font-weight: bold'>2.1 طرف دوم قرارداد</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>تمام اشخاصی که طبق تعریف و مفاد این سند، در  “EIED+” ثبت‌نام و یا از خدمات آن (موضوع قرارداد) استفاده می‌کنند که از این پس در این سند حسب مورد «ارائه دهنده خدمات»، «پیمانکار» خوانده می‌شوند.</div>
            <div style='margin-top: 40px; font-weight: bold'>3.1 تعاریف</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>در قرارداد حاضر، اصطلاحات زیر در معانی مذکور در این ماده به‌کار رفته‌اند. کلماتی که تعریف نشده‌اند، توسط مرجع تفسیر در این قرارداد تفسیر می‌شوند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'> الف. کاربر: هر شخصی که وارد  “EIED+” می‌شود، پس از احراز شماره تلفن همراه و اطلاعات ثبت احوال کاربر   “EIED+” است و ملزم به رعایت مقررات این قرارداد است.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'> ب. پیمانکار و یا متقاضی: هر شخصی که وارد  “EIED+” می‌‎شود و با درج اطلاعات پروفایل خود از قبیل حوزه فعالیت، مشخصات مورد درخواست و آدرس، ثبت نام می نماید.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'> ج. شرکت: شرکت ها و موسساتی که با درج اطلاعات درخواستی در پروفایل از قبیل حوزه فعالیت، مجوزهای کسب و کار، آدرس و... اقدام به ثبت نام می نماید.</div>

            <div style='margin-top: 40px; font-weight: bold; margin-bottom: 14px'>2- مسئولیت های  “EIED+” و کلیه کاربران</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>1.2 کاربران می‌پذیرند و موظف هستند که از خدمات ارائه شده در اپلیکیشن “EIED+” برای انجام هیچ فعالیت غیر‌قانونی طبق قوانین جمهوری اسلامی ایران، خلاف شرع و مخالف با عرف جامعه استفاده نکنند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>2.2 کاربر تعهد مینماید که ضمن مطالعه کامل این قرارداد، کلیه اطلاعات لازم برای ثبت نام(Registration) را به صورت دقیق و صحیح و منطبق با واقعیت وارد نماید و با توجه به اصل حسن نیت، مسئولیت عدم صحت اطلاعات اعلام شده از سوی کاربر در زمان ثبت نام با کاربر بوده و “EIED+” هیچ مسئولیتی از این حیث ندارد، بدیهی است اطلاعات ورودی تماما راستی آزمایی شده و در صورت مغایرت “EIED+” این حق را دارد که کاربر مورد نظر را در هرزمانی غیر فعال نماید.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>3.2 کاربر می پذیرد و این مجوز را به “EIED+” می دهد تا از درگاه های ارائه دهنده سرویس استعلام در دولت برای احراز هویت و راستی آزمایی اطلاعات کاربر استفاده نماید.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>4.2 حداقل سن برای ایجاد حساب کاربری برای عموم اشخاص حقیقی، 25 سال تمام و مشروط بر داشتن اهلیت قانونی برای معامله (بالغ، عاقل و رشید بودن) و عدم ممنوعیت قانونی برای آنهاست.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>5.2  “EIED+” در صورت تکمیل ثبت نام یک حساب اختصاصی به کاربر اعطا میکند. کاربر دارای حق انحصاری برای استفاده از حساب کاربری خود بوده اما از اهدا، قرض، اجاره، انتقال و فروش آن به سایرین منع میگردد. مسئولیت مراقبت و محافظت از حساب کاربری و هر فعالیتی که تحت کد و حساب کاربری وی انجام میگیرد به عهده شخص کاربر میباشد و در صورت تغییر مالکیت حساب کاربری می بایست به اطلاع و تایید “EIED+” برسد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>6.2 کاربر درصورت تغییر مشخصات کد پستی و آدرس، میبایست اطلاعات خود را به صورت صحیح اصلاح نماید.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>7.2 ایجاد حساب کاربری در “EIED+” و همچنین مفاد این قرارداد و دیگر اسناد “EIED+” ، هیچ نوع تعهد، توافق و قراردادی نظیر ایجاد شعبه، مشارکت و سرمایه‌گذاری مشترک، یا رابطه‌ای نظیر استخدامی یا پیمانکاری، حق فنی، شراکت، عاملیت فروش، نمایندگی یا مانند آن را مابین کاربر و “EIED+” ایجاد نخواهد کرد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>8.2 “EIED+” هنگام ایجاد حساب کاربری یا ارائه خدماتش، مجاز است در مراحل و زمان‌های مختلف اطلاعاتی را از کاربر به صورت الکترونیکی یا کاغذی یا اشکال دیگر و به صورت منفرد یا متعدد درخواست و دریافت کند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>9.2 کاربر با ایجاد حساب کاربری، رضایت خود را جهت دسترسی “EIED+” به اطلاعات خود و استفاده از آن، به ‌‌شیوه‌ای که در این قرارداد یا دیگر اسناد و دستورالعمل‌ها و آیین‌نامه‌های متعلق به “EIED+” بیان می‌شود، اعلام می‌کند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>10.2 کاربر با ایجاد حساب کاربری، رضایت خود را جهت دسترسی“EIED+” نسبت به حفظ حریم شخصی و اطلاعات خصوصی کاربر متعهد است و از این اطلاعات برای بهبود تجربه‌های کاربری و تسهیل روابط تجاری فی‌مابین کاربران استفاده می‌کند. همچنین به دلیل رعایت مسائل امنیتی، صحت‌سنجی، پیگیری‌های حقوقی و قانونی، افزایش بهره‌وری و دقت در فرآیندهای کاری “EIED+” ، ممکن است اطلاعات دریافتی کاربر، توسط کارکنان مختلف “EIED+” یا گروه‌های مشاور و همکار، در زمان‌بندی‌های مختلف رؤیت و بررسی گردد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>11.2 در صورتیکه کاربر متوجه هر گونه استفاده غیر قانونی از حساب خود گردد باید مراتب را سریعا به “EIED+” اطلاع دهد. لازم به ذکر است که پاسخ به هر تقاضایی از جانب کاربر برای “EIED+” نیازمند زمان منطقی میباشد. بنابراین “EIED+” از پذیرش مسئولیت در برابر عواقب رخ داده قبل از هرگونه اقدام مقتضی معاف خواهد بود.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>12.2  اگر اطلاعاتی که کاربر در زمان ایجاد حساب کاربری خود وارد میکند منجر به نقض قوانین، مقررات، سیاستهای عمومی و یا منافع مشروع شخص و گروه ثالث گردد “EIED+” مجاز است مانع استفاده از حساب کاربری شود.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>13.2 مطابق این قرارداد، شخصی که شماره وی به عنوان شماره اصلی کاربر انتخاب شده باشد، به “EIED+” وکالت داده است که در صورت عدم پاسخگویی یا عدم تمایل به ادامه همکاری، “EIED+” بتواند در خصوص حساب کاربری وی تصمیم گیری نماید. اتخاذ هر تصمیمی در این رابطه الزامی است و کاربران حق اعتراض به آن را ندارند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>14.2  اختلال احتمالی در خدمت رسانی “EIED+” ناشی از ایرادات و مشکلات مخابراتی، شبکه های اینترنتی، قطع برق، حملات هکرها و غیره بر عهده “EIED+” نمیباشد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>15.2 استفاده از خدمات توسط کاربر هیچگونه تعهدی در قبال عدم رعایت قوانین و مقررات و اختلافات و مشاجرات حاصل از آن که توسط افرادی غیر مرتبط با “EIED+” ایجاد شده برای “EIED+” در پی نخواهد داشت.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>16.2 کاربران اهمیت و ضرورت هر یک از توافقات و قوانین ذکر شده را کاملا درک کرده و موافقت میکنند که “EIED+” هیچگونه تعهدی نسبت به دعوی ها، جریمه ها و مجازاتها، مسئولیتها، هزینه ها یا ضررهای ناشی از نقض قوانین توسط کاربران نخواهد داشت؛ جز در مواردی که در توافقات عنوان گردیده یا خطای جدی “EIED+” در این زمینه اثبات گردد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>17.2 “EIED+” به دلایل متعددی، از جمله درک رفتار کاربران و مخاطبان خود و تدارک تجربه بهتری برای آنها، از فن‌آوری‌هایی مانند کوکی‌ها (نظیر cookies, clear gifs, log files, and flash cookies) استفاده می‌‌کند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>18.2 “EIED+” راه‌های ارتباطی خود با کاربران را از طریق سایت رسمی خود به نشانی https://plus.eied.com اعلام می‌کند و از این طریق با کاربران خود ارتباط برقرار می نماید.</div>

            <div style='margin-top: 40px; font-weight: bold; margin-bottom: 14px'>3- مسئولیت های “EIED+” و کاربران</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>1.3  اپلیکیشن و نرم افزار “EIED+” یک بازارگاه آنلاین است نه فروشگاه اینترنتی؛ بنابراین “EIED+” هیچ نقش مستقیم یا غیر مستقیمی در مدیریت سفارشات را ندارد و کاربر با آگاهی از این موضوع، در “EIED+” در فرایند مناقصه شرکت می کند. تصریح می‌گردد که “EIED+” در چارچوب این قرارداد در قالب خریدار یا فروشنده تعریف نشده و کارفرمای هر پروژه در سایت می باشد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>2.3 کاربر برای آغاز فعالیت پیمان، باید احراز هویت شود که شامل احراز مشخصات سجلی، کد ملی، آدرس و مالکیت شماره همراه می باشد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>3.3  الزامات قانونی فعالیت در بستر الکترونیک، که در قوانین کشور وجود دارد، مانند قانون تجارت الکترونیکی در “EIED+” نیز حاکم و جاری است و عدم آگاهی کاربر از آنها موجب حقی برای او نخواهد شد یا مسئولیتی برای “EIED+” ایجاد نخواهد کرد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>4.3 کاربران متعهد می شوند که تمامی محصولاتی و برآیندی که در بستر “EIED+”  عرضه می نمایند، به صورت قانونی متعلق به EIED+” بوده و به هیچ وجه ادعایی نسبت به آن نخواهند داشت.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>5.3 کاربر متعهد می شود اطلاعات عملکرد  خود اعم از عکس فایل، تحت هر فرمت را به صورت دقیق در سایت وارد نمایند.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>6.3 کاربر متعهد می شود که مسئولیت های “EIED+” را مطالعه کرده و ضمن قبول آن شرایط، نقش “EIED+” مبنی بر  کارفرمای پروژه در موضوع را بپذیرد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>7.3 هرگونه عدم شفافیت در ارائه مشخصات و سفارش (عکس، مقدار، قیمت، کیفیت و آدرس)  ابتدا به منزله نمره منفی و در صورت تکرار به غیر فعال کردن حساب کاربری منجر خواهد شد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>8.3  اعلام قیمت اولیه می بایست بر اساس برآورد .واقعی و خالص باشد و در غیر این صورت سفارش حذف و نمره منفی برای کاربر دارد.</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>9.3 تسویه حساب با کاربر پس از اخذ تائیدیه ها و ارائه کلیه مدارک لازم انجام می شود</div>

            <div style='margin-top: 40px; font-weight: bold; margin-bottom: 14px'>4- مالکیت فکری و معنوی</div>
            <div style='font-weight: 600; margin-bottom: 26px; text-align: justify'>1.4 تمامی مالکیت معنوی نرم افزار “EIED+” همچون کپی رایت، حق ثبت علامت تجاری، حق ثبت اختراع (حق امتیاز)، رازهای تجاری همچنین تمامی اطلاعات مربوطه شامل واژه ها و عبارتها، آیکون و تصویر، چیدمان، نمودارها، رنگ، طرحهای هندسی ، قالب طرح، داده های مربوطه، موارد چاپی و اسناد الکترونیک همگی تحت حمایت قانون کپی رایت، قانون ثبت علائم تجاری، قانون حق امتیاز، معاهدات بین المللی مربوطه و دیگر قوانین و مقررات مربوط به مالکیت معنوی میباشد. “EIED+” دارای حق مالکیت معنوی نرم افزار موبایل “EIED+” و تمامی محتوای آن میباشد.</div>
            <div style='font-weight: 600; text-align: justify'>2.4 کاربر حق نصب نرم افزار “EIED+” برای اهداف تجاری و یا کپی، تغییر، دخل و تصرف و اقتباس آن (همچون دسترسی به نرم افزار “EIED+” و سیستم مربوط به آن از طریق  Pluginsیا ابزارها و سرویسهای Third Party غیر مجاز) با توجه به نرم افزار و داده های انتقال یافته به حافظه کامپیوتر و داده های تعاملی بین کاربر و سرور در زمان اجرای نرم افزار را ندارد.</div>
        </div>
        ";

        return $Contract;
    }
}
