<?php

namespace Modules\WorkPackageManager\Http\Controllers;

use Illuminate\Routing\Controller;
use Morilog\Jalali\Jalalian;

class SignatureTextController extends Controller
{
    public static function SignatureText($data)
    {

        $package_number = $data['details']['package_number'];
        $Title = $data['details']['title'];
        $wp_activation_time = Jalalian::forge($data['details']['wp_activation_time'])->format('H:i - Y/m/d');
        $first_name = $data['details']['freelancer']['users']['first_name'];
        $last_name = $data['details']['freelancer']['users']['last_name'];
        $meli_code = $data['details']['freelancer']['meli_code'];
        $address = $data['details']['freelancer']['address'];
        $postal_code = $data['details']['freelancer']['postal_code'];
        $home_phone = $data['details']['freelancer']['home_phone'];
        $desc = $data['details']['desc'];
        $wp_final_time = $data['details']['wp_final_time'];
        $wp_final_price = $data['details']['wp_final_price'] ? number_format($data['details']['wp_final_price']) : '';
        $work_package_activity = $data['details']['work_package_activity'];
        $shaba = $data['details']['freelancer']['shaba'];
        $daily_fine = $data['details']['daily_fine'] ? number_format($data['details']['daily_fine']) : '';
        $fine_after_day = $data['details']['fine_after_day'] ? number_format($data['details']['fine_after_day']) : '';
        $fine_after_price = $data['details']['fine_after_price'] ? number_format($data['details']['fine_after_price']) : '';
        $fine_after_negative = $data['details']['fine_after_negative'] ? number_format($data['details']['fine_after_negative']) : '';
        $address = $data['details']['freelancer']['address'];
        $postal_code = $data['details']['freelancer']['postal_code'];
        $home_phone = $data['details']['freelancer']['home_phone'];

        $Contract = "
        <div dir='rtl' style='font-size: 10pt; font-size: 15px'>
            <div style='text-align: center; font-weight: bold; margin-bottom: 50px;'>قرارداد <br/>برون سپاری انجام خدمات مهندسی</div>

            <div style='font-weight: bold; text-align: center'>عنوان و شماره بسته کاری</div>
            <div style='text-align: center;margin-bottom: 50px'> $package_number - $Title</div>

            <div style='text-align: center; font-weight: bold'>تاریخ:</div>
            <div style='margin-bottom: 40px; text-align: center'>$wp_activation_time</div>

            <div  style='margin-bottom: 40px; text-align: center; font-weight: bold'>به نام خدا</div>
            <div>این قرارداد در تهران بین شرکت طراحی و مهندسی صنایع انرژی (EIED) به شماره ثبت 140735 و شناسه ملی 10101837663 دارای کد اقتصادی به شماره 5933-1119-4111 به نمایندگی آقای سید محمدعلی غفاریزاده (مدیر عامل) به آدرس تهران - محله اراج - خیابان گلشن - خیابان شهید مصباح (گلزار) - پلاک 27، کدپستی 1693938611 و شماره تماس 72385000 که در این قرارداد به اختصار 'کارفرما' نامیده می شود، از یک طرف و
                آقا/خانم $first_name $last_name
                ﺑﻪ کد ملی $meli_code
                و آدرس $address
                کد پستی $postal_code
                شماره تماس $home_phone
                ﮐﻪ در اﯾﻦ قرارداد به اختصار 'مشاور' ﻧﺎﻣﯿﺪه ﻣﯽ‌ﺷﻮد، از طرف دﯾﮕﺮ، مطابق با شرایط و مشخصات زیر منعقد و مفاد آن برای طرفین لازم الاجرا می‌باشد.
            </div>

            <div style='margin-top: 40px; font-weight: bold'>ماده یک - موضوع قرارداد</div>
            <div style='margin-bottom: 10px'>ﻣﻮﺿﻮع ﻗﺮارداد عبارت است از ارائه خدمات برون سپاری انجام خدمات مهندسی و طراحی مطابق با شرح خدمات مندرج در پیوست شماره 2 و سایر شرایط مندرج در قرارداد.</div>
            <div style='font-weight: bold'>خلاصه بسته کاری:</div>
            <div>$desc</div>

            <div style='margin-top: 40px; font-weight: bold'>ماده دو – اسناد و مدارک قرارداد</div>
            <div>اﺳﻨﺎد و ﻣﺪارك ﺑﻪ ﺗﺮﺗﯿﺐ اوﻟﻮﯾﺖ زﯾﺮ، در ﻣﺠﻤﻮع ﻗﺮارداد ﺑﯿﻦ ﮐﺎرﻓﺮﻣﺎ و مشاور را ﺗﺸﮑﯿﻞ ﻣﯽ دﻫﻨﺪ و ﻫﺮ ﯾﮏ، ﺑﻪ ﻋﻨﻮان ﺟﺰﺋﯽ از ﻗﺮارداد ﻣﺤﺴﻮب ﻣﯽ‌ﺷﻮﻧﺪ:
                <div style='padding-right: 12px;'>
                    <div style='margin: 4px 0'>2-1- قرارداد حاضر</div>
                    <div style='margin: 4px 0;'>2-3- شرح خدمات در تعهد مشاور</div>
                    <div style='margin: 4px 0;'>2-4- برنامه زمانبندی</div>
                    <div style='margin: 4px 0;'>2-5- تعهدنامه محرمانگی</div>
                </div>
            </div>

            <div style='margin-top: 40px; font-weight: bold'>ماده سه – تاریخ شروع کار و مدت قرارداد</div>
            <div >
                <div style='padding-right: 12px;'>
                    <div style='margin: 4px 0'>3-1- تاریخ نافذ شدن اﯾﻦ ﻗﺮارداد پس از اﻣﻀﺎء ﺗﻮﺳﻂ ﻃﺮﻓﯿﻦ و ﻣﺒﺎدﻟﻪ ﻗﺮارداد می‌باشد.</div>
                    <div style='margin: 4px 0'>3-2- ﺗﺎرﯾﺦ ﺷﺮوع بکار ﻗﺮارداد از ﺗﺎرﯾﺦ ابلاغ کارفرما و ارائه تضمین انجام تعهدات ﻣﯽ ﺑﺎﺷﺪ.</div>
                    <div style='margin: 4px 0'>3-3- ﻣﺪت انجام و تکمیل خدمات موضوع قرارداد مندرج در ماده یک، از ﺗﺎرﯾﺦ ﺷﺮوع بکار، به مدت <span class='font-bold text-[14px]'>$wp_final_time</span> روز تقویمی می‌باشد.</div>
                </div>
            </div>

            <div style='margin-top: 40px; font-weight: bold'>ماده چهار – مبلغ قرارداد</div>
            <div>ﻣﺒﻠﻎ ﻗﺮارداد جهت اجرای موضوع مندرج در ماده یک ﺑﻪ ﺻﻮرت ناخالص معادل <span class='font-bold text-[14px]'>$wp_final_price</span> تومان می‌باشد.
                <div style='padding-right: 12px;'>
                    <div style='margin: 4px 0'>4-4- تا تکمیل و تحویل کامل کار، هیچگونه افزایش قیمت، مابه التفاوت و تعدیل به مشاور تعلق نخواهد گرفت.</div>
                    <div style='margin: 4px 0'>4-5- مشاور در تهیه پیشنهاد قیمت، سود مورد نظر خود و تمام هزینه های ناشی از اجرای مفاد بندهای قرارداد اعم از مستقیم و غیر مستقیم را در نظر گرفته و بعداً از هیچ بابت حق درخواست اضافه پرداختی ندارد.</div>
                    <div style='margin: 4px 0'>4-6- در صورتی که در مدت قرارداد کارهای خارج از موضوع مندرج در پیوست شماره یک بروز نماید، کارفرما می تواند آن را طی دستور کار جداگانه ای به مشاور ابلاغ نموده و هزینه آن بر اساس نرخ نفر-ساعت مندرج در بند 4 - 1 و بر اساس میزان نفر ساعت مصرفی مورد توافق طرفین، محاسبه و پرداخت می گردد.</div>
                    <div style='margin: 4px 0'>4-7- مبالغ مرتبط با مالیات بر ارزش افزوده در قیمت لحاظ نشده است و مطابق با قوانین جاری و ضوابط مرسوم و در صورت ارائه گواهی معتبر ثبت نام مؤدیان مالیاتی و صورت حساب با فرمت مورد تایید سازمان امور مالیاتی در وجه مشاور قابل پرداخت می باشد.</div>
                    <div style='margin: 4px 0'>4-8- حجم کارهای ابلاغی با نظر کارفرما می تواند حداکثر تا سقف 25 % مبلغ قرارداد افزایش و یا کاهش یابد که در اینصورت مشاور متعهد می‌گردد موضوع قرارداد را مطابق با برنامه زمانی مورد نظر کارفرما و با نرخ مندرج در این ماده بطور کامل به انجام رساند.</div>
                    <div style='margin: 4px 0'>4-9- کلیه پرداخت ها به صورت ریالی بوده و در مقابل درخواست مشاور و ارائه صورت وضعیت و پس از تایید كارفرما و مطابق با روش مندرج در ماده 5 قرارداد و پس از اعمال كسـور قانونی و قراردادی (مطابق ماده 6) به مشاور پرداخت می‌گردد.</div>
                </div>
            </div>

            <div style='margin-top: 40px; font-weight: bold'>ماده پنج - نحوه پرداخت</div>
            <div style='margin-bottom: 4px'>نحوه پرداخت حق الزحمه مشاور به شرح زیر می‌باشد:</div>
            <div>
                    ";
        if (isset($work_package_activity) && count($work_package_activity)) {
            $Contract .= "<table style='width: 100%; margin-bottom: 24px' class='table-activity'>
                    <thead>
                    <tr>
                        <th>عنوان فعالیت</th>
                        <th style='width: 200px' class='text-center'>درصد پرداخت</th>
                        <th style='width: 200px;' class='text-center'>تاریخ سر رسید</th>
                    </tr>
                    </thead>
                    <tbody>";
        }
        foreach ($work_package_activity as $activity) {
            $Contract .= "
                <tr>
                    <td>{$activity['title']}</td>
                    <td class='text-center'>{$activity['price_percentage']}%</td>
                    <td class='text-center'>-</td>
                </tr>
            ";

            foreach ($activity['categories'] as $category) {
                $date = \Morilog\Jalali\Jalalian::forge($category['due_date'])->format('Y/m/d');
                $Contract .= "
                <tr>
                    <td>- {$category['title']}</td>
                    <td class='text-center'>{$category['price_percentage']}%</td>
                    <td class='text-center'>{$date}</td>
                </tr>
                ";

                foreach ($category['task'] as $task) {
                    $date = \Morilog\Jalali\Jalalian::forge($task['due_date'])->format('Y/m/d');
                    $Contract .= "
                            <tr>
                                <td>-- {$task['title']}</td>
                                <td class='text-center'>{$task['price_percentage']}%</td>
                                <td class='text-center'>{$date}</td>
                            </tr>
                        ";
                }
            }
        }


        if (isset($work_package_activity) && count($work_package_activity)) {
            $Contract .= "</tbody>
                </table>";
        }
        $Contract .= "
            </div>
            <div>اطلاعات حساب بانکی مشاور جهت پرداخت حق الزحمه به شرح زیر می‌باشد:
                <div>شماره شبا حساب بانکی IR-$shaba</div>
            </div>

            <div>تبصره: ملاک عمل برای پرداخت کلیه صورت وضعیتها، تصدیق آن صورت وضعیت توسط شرکت بوده و تایید مسئول بسته کاری صرفا به معنی تایید بعد فنی انجام تعهدات فریلنسر می باشد.</div>

            <div class='font-black mt-40 mt-[40px]'>ماده شش – کسور قانونی و قراردادی</div>
            <div>
                <div style='padding: 12px'>
                    <div style='margin: 4px 0;'>6-1- از هر پرداخت به مشاور براساس مبلغ پیش پرداختی که پرداخت شده است، درصدی بابت استهلاک پیش پرداخت کسر می‌گردد. این درصد به گونه ای است که کل مبلغ پیش پرداخت تا صورت وضعیت ماقبل قطعی مشاور مستهلک گردد.</div>
                    <div style='margin: 4px 0;'>6-2- تضمین پیش پرداخت پس از استهلاک کل مبلغ پیش پرداخت و پس از تحویل کار و انجام کلیه تعهدات قراردادی با تایید کارفرما به مشاور مسترد خواهد شد.</div>
                    <div style='margin: 4px 0;'>6-3- در اجرای ماده 38 قانون بیمه تأمین اجتماعی، از هر صورت وضعیت مشاور 5 % ( پنج درصد ) بابت ودیعه بیمه تأمین اجتماعی کسر خواهد شد. این ودیعه به همراه ﺻﻮرت وﺿﻌﯿﺖ نهایی مشاور پس از ارائه اصل مفاصا حساب بیمه تأمین اجتماعی پرداخت خواهد شد.</div>
                    <div style='margin: 4px 0;'>6-4- از هر پرداخت به مشاور 10 % (ده درصد) به عنوان تضمین حسن انجام کار کسر می‌گردد. در ﺻﻮرت ﻋﺪم ﺑﺪﻫﯽ مشاور ﺑﻪ ﮐﺎرﻓﺮﻣﺎ، ﻣﺒﺎﻟﻎ ﺳﭙﺮده ﺣﺴﻦ اﻧﺠﺎم ﮐﺎر پس از طی مدت 12 ماه (دوره تضمین) پس از تایید مدارک و گزارشات نهایی توسط کارفرما و کارفرمای اصلی و پس از ارائه اصل مفاصا حساب بیمه تأمین اجتماعی با درخواست مشاور مسترد خواهد شد.</div>
                </div>
            </div>

            <div class='font-black mt-40 mt-[40px]'>ماده هفت – تعهدات مشاور</div>
            <div>
                <div class='pr-3'>
                    <div style='margin: 4px 0;'>7-1- مشاور حق واگذاری تمام یا قسمتی از تعهدات موضوع این قرارداد را به شخص یا اشخاص ثالث ندارد و در صورت انجام این كار، كارفرما حـق فسخ قرارداد را خواهد داشت.</div>
                    <div style='margin: 4px 0;'>7-2- مشاور متعهد می‌گردد که کلیه اسناد، مدارک، فایلها و اطلاعات کسب شده از کارفرما را که به اقتضاء و ضرورت جهت انجام تعهدات در اختیار وی قرار می‌گیرد یا ضمن کار به آنها دسترسی پیدا می کند و همچنین کلیه اسناد، مدارک و نقشه هایی را که خود تهیه و تولید می کند کاملاً محرمانه تلقی نماید. همچنین از افشاء به غیر و یا بکار بردن آنها چه در طول مدت قرارداد و چه پس از خاتمه آن جداً خودداری نماید. بدیهی است مشاور حق واگذاری و استفاده از این موارد در هیچ پروژه دیگری را نخواهد داشت و موظف است پس از انجام موضوع قرارداد، تمامی مدارک را به کارفرما مسترد نماید.</div>
                    <div style='margin: 4px 0;'>7-3- مشاور متعهد به رعایت کامل مفاد تعهد نامه محرمانگی (پیوست شماره چهار) می‌باشد و درصورت خاتمه یا فسخ این قرارداد و یا اتمام کار، شرایط آن تفاهم نامه مستقل از این قرارداد پابرجا می‌باشد.</div>
                    <div style='margin: 4px 0;'>7-4- مشاور از کم و کیف کار کاملاً مطلع می‌باشد، شرح خدمات، اسناد و مشخصات فنی را به طور کامل مطالعه نموده است و متعهد است کلیه کارهای موضوع قرارداد را طبق شرح کار و استانداردهای مرجع و دستور کارها، زیر نظر کارفرما بدون عیب و نقص تکمیل و نتایج را در زمان مقرر به کارفرما تحویل نماید.</div>
                    <div style='margin: 4px 0;'>7-5- چنانچه مشاور نسبت به شروع کار در موعد مقرر اقدام ننماید، كارفرما مخیر به فسخ و جریمه مشاور خواهد بود.</div>
                    <div style='margin: 4px 0;'>7-6- مشاور ملزم به رعایت دقیق برنامه زمانبندی اجرای کار می‌باشد و جبران هرگونه خسارت وارده به کارفرما که ناشی از تأخیر در انجام، تأخیر در تحویل کار، سهل انگاری، عدم توجه یا عدم مهارت لازم مشاور باشد، به عهده مشاور بوده و وی موظف به رفع نواقص کار و جبران خسارت وارده خواهد بود. هزینه های رفع نواقص و یا جبران خسارت بر عهده مشاور خواهد بود.</div>
                    <div style='margin: 4px 0;'>7-7- در صورتیکه مشاور به هر دلیل دچار تأخیر گردد، براساس ماده 14 قرارداد عمل خواهد شد. همچنین کارفرما می تواند راساً نسبت به انجام عملیات اقدام نموده و کلیه هزینه ها را به اضافه 35 % بالاسری به حساب بدهی مشاور منظور نماید.</div>
                    <div style='margin: 4px 0;'>7-8- مشاور موظف است هرگونه اشکال یا نقص کار خود را به هزینه خود و مطابق با نظر کارفرما سریعاً برطرف کند. تایید ﻣﺪارك و گزارش های نهایی از ﺳﻮی ﮐﺎرﻓﺮﻣﺎ، از ﻫﯿﭻ ﯾﮏ از ﻣﺴﺌﻮﻟﯿﺖ ﻫﺎ و ﺗﻌﻬﺪات ﻗﺮاردادی مشاور ﻧﻤﯽ ﮐﺎﻫﺪ.</div>
                    <div style='margin: 4px 0;'>7-9- مشاور موظف است در هر زمان و به هر میزان بر حسب ضرورت و اعلام کارفرما در جلسات فنی با کارفرما شرکت نموده و از مدارک تهیه شده دفاع نماید.</div>
                    <div style='margin: 4px 0;'>7-10- مشاور متعهد است وظایف محوله مربوط را که مطابق با نظر کارفرما یا نماینده وی محول می شود را به نحو احسن و در زمان مورد نیاز به انجام رساند.</div>
                    <div style='margin: 4px 0;'>7-11- مشاور متعهد است کلیه گزارش ها و مدارک و مکاتبات در تعهد خود را به دو زبان انگلیسی و فارسی و در فرمت مورد تایید کارفرما ارائه دهد. همچنین مشاور موظف است به همراه هر مدرک یا گزارش ارسالی، فایل اصلی قابل ویرایش (Native) مدارک و محاسبات را نیز به کارفرما ارسال نماید.</div>
                    <div style='margin: 4px 0;'>7-12- مشاور متعهد است نسبت به ارائه و ارسال گزارشات پیشرفت کار به صورت دو هفتگی به کارفرما اقدام نماید.</div>
                    <div style='margin: 4px 0;'>7-13- مشاور موظف است تا در پایان مدت قرارداد (در صورت عدم تمدید) یا در صورت خاتمه یا فسخ قرارداد به هر علت و در هر زمان، نسبت به تحویل اسناد و مدارک و انتقال امور و فعالیتهای در دست اقدام به نماینده کارفرما در اسرع وقت اقدام نماید.</div>
                    <div style='margin: 4px 0;'>7-14- مشاور ضمن اقرار نسبت به داشتن آگاهی کامل از قوانین تأمین اجتماعی و قانون کار ملزم به رعایت مفاد آن می‌باشد. مشاور مکلف است بر اساس قانون بیمه تأمین اجتماعی، کلیه کارکنانی را که برای اجرای موضوع این قرارداد به کار می‌گمارد، طبق قوانین و مقررات مربوطه، نزد سازمان بیمه تأمین اجتماعی بیمه نموده و حق بیمه های متعلقه را به طور کامل و منظم به شعبه مربوطه سازمان تأمین اجتماعی پرداخت نماید. بدیهی است حل و فصل کلیه مسائل مربوط به تأمین اجتماعی و اخذ مفاصاحساب از آن سازمان و همچنین اداره کار بر عهده و هزینه مشاور است.</div>
                    <div style='margin: 4px 0;'>7-15- مشاور موظف به تهیه بیمه نامه مسئولیت مدنی در قبال کارکنان برای پرسنل و بیمه نامه اشخاص ثالث می‌باشد و شرایط آن را می‌بایست قبلا به تایید کارفرما برساند و یک کپی از آن را به کارفرما تسلیم نماید. مشاور مسئول کلیه خسارات وارده به پرسنل خود و اشخاص ثالث بوده و موظف به جبران آن می‌باشد.</div>
                    <div style='margin: 4px 0;'>7-16- ﻫﺰﯾﻨﻪ اﻧﻮاع ﻣﺎﻟﯿﺎت ﻫﺎ، ﺣﻖ ﺑﯿﻤﻪ ﺗﺄﻣﯿﻦ اﺟﺘﻤﺎﻋﯽ و ﺳﺎﯾﺮ ﺣﻘﻮق دوﻟﺘﯽ بر عهده مشاور می‌باشد. درصورت عدم پرداخت هرگونه حقوق دولتی و عوارضی كه پرداخت آن بعهده و هزینه مشاور می‌باشد و اعلام بدهی از سوی مراجع قانونی و قضایی (اعم از سازمان تأمین اجتماعی، دارایی و غیره) كارفرما این بدهی را از محل مطالبات و تضامین مشاور منجمله از محل تضمین حسن انجام كار كسر و در وجه مراجع ذیربط كارسازی خواهد نمود و مشاور در این خصوص حق هیچگونه ادعا و اعتراضی را نخواهد داشت.</div>
                    <div style='margin: 4px 0;'>7-17- هزینه های مربوط به ایاب و ذهاب پرسنل، تأمین کلیه تجهیزات، ابزار و وسایل کار مورد نیاز جهت اجرای کار و به طور کلی هر آنچه که جهت انجام کامل کار و اجرای تعهدات این قرارداد لازم است مگر آنچه که در بخش تعهدات کارفرما به صراحت قید شده باشد، به عهده و هزینه مشاور می‌باشد.</div>
                    <div style='margin: 4px 0;'>7-18- همه كسانی كه به منظور اجرای خدمات موضوع قرارداد، به صورت دایم یا موقت، به‌ هزینه مشاور و برای او خدماتی را انجام می‌دهند، كاركنان مشاور شناخته می‌شوند و مسئولیت عملكرد آنها در مورد خدمات موضوع قرارداد، به عهده مشاور است.</div>
                    <div style='margin: 4px 0;'>7-19- کارفرما تنها مرجع فنی مشاور برای اجرای قرارداد است، نظریه کارفرما در مورد کیفیت کار انجام شده و نفرات مشاور قطعی است و مشاور ملزم به قبول آن می‌باشد.</div>
                    <div style='margin: 4px 0;'>7-20- مشاور موظف است بر مبنای Procedure مورد تایید کارفرما شرخ خدمات را انجام و ارائه نماید.</div>
                    <div style='margin: 4px 0;'>7-21- مشاور موظف است صورت وضعیت های کارکرد را در سه نسخه و بر اساس کارکرد و به صورت تجمیعی تهیه و همراه با فایل الکترونیکی فرموله آن جهت رسیدگی به نماینده کارفرما تسلیم نماید. کلیه صفحات صورت وضعیت می‌بایست دارای مهر و امضای مشاور باشد.</div>
                    <div style='margin: 4px 0;'>7-22- بسته کاری اگر ماهیت اختراع پیدا کند طبق قانون حمایت از مالکیت صنعتی ماده 9 اختراع متعلق به کارفرما خواهد.</div>
                </div>
            </div>

            <div class='font-black mt-40 mt-[40px]'>ماده هشت – تعهدات کارفرما</div>
            <div >
                <div style='padding-right: 12px;'>
                    <div style='margin: 4px 0;'>8-1- کارفرما متعهد می شود تا مدارک و اطلاعات مورد نیاز مشاور در خصوص موضوع قرارداد را در اختیار مشاور قرار دهد.</div>
                    <div style='margin: 4px 0;'>8-2- کارفرما متعهد می شود که نماینده تام الاختیار خود را برای همکاری با مشاور تعیین و همزمان با مبادله قرارداد به مشاور معرفی کند.</div>
                </div>
            </div>

            <div class='font-black mt-40 mt-[40px]'>ماده نه – نماینده کارفرما</div>
            <div>نماینده کارفرما جهت نظارت بر اجرای تعهدات مشاور در این قرارداد، مدیر بخش مکانیک می‌باشد.</div>

            <div class='font-black mt-40 mt-[40px]'>ماده ده – محل پروژه</div>
            <div>محل اجرای پروژه، استان ایلام بوده و محل انجام خدمات مهندسی مطابق با شرح خدمات این قرارداد شهر تهران در دفتر مشاور می‌باشد.</div>
            <div>محل برگزاری جلسات ساختمان مرکزی کارفرما (شرکت EIED) می‌باشد.</div>

            <div class='font-black mt-40 mt-[40px]'>ماده یازده - مقررات ایمنی- حراستی و رعایت الزامات زیست محیطی و بهداشت محیط کار</div>
            <div>
                <div class='pr-3'>
                    <div style='margin: 4px 0;'>11-1- مشاور تایید می نماید به کلیه قوانین، مقررات و بخشنامه های مرتبط با الزامات زیست محیطی و بهداشت محیط کار آگاهی دارد.</div>
                    <div style='margin: 4px 0;'>11-2- مشاور موظف است قبل از شروع به کار، هماهنگی لازم با نمایندگان HSE کارفرما را بعمل آورد.</div>
                    <div style='margin: 4px 0;'>11-3- مشاور متعهد است که در زمان حضور در سایت و یا در زمان حضور در دفتر کارفرما، کلیه مقررات حفاظتی، اداری، ایمنی، بهداشت شغلی و الزامات زیست محیطی و کلیه دستورالعمل های QHSE کارفرما و کارفرمای اصلی را دقیقاً رعایت نماید.</div>
                </div>
            </div>

            <div class='font-black mt-40 mt-[40px]'>ﻣﺎده دوازده - زﺑﺎن قرارداد</div>
            <div>زﺑﺎن ﺣﺎﮐﻢ در ﺑﺨﺶ ﻫﺎی ﻣﺨﺘﻠﻒ اﺳﻨﺎد ﻗﺮارداد ﮐﻪ در زﻣﺎن ﻋﻘﺪ ﻗﺮارداد ﺑﻪ اﻣﻀﺎی دو ﻃﺮف رﺳﯿﺪه اﺳﺖ، زﺑﺎن فارسی اﺳﺖ. زﺑﺎن ﻣﻮرد اﺳﺘﻔﺎده در اﺳﻨﺎد و مدارک فنی و گزارش نهایی ﮐﻪ در ﻃﻮل اﺟﺮای ﻣﻮﺿﻮع ﻗﺮارداد ﺑﻪ وﺳﯿﻠﻪ ﮐﺎرﻓﺮﻣﺎ و مشاور ﺗﻬﯿﻪ و ﻣﺒﺎدﻟﻪ ﻣﯽ‌ﺷﻮﻧﺪ، در ﻫﺮ ﻣﻘﻄﻊ ﺗﻮﺳﻂ ﮐﺎرﻓﺮﻣﺎ ﻣﻌﯿﻦ ﻣﯽ‌ﺷﻮد. در صورتی که مدارک قرارداد علاوه بر زبان فارسی به زبان‌های دیگر نیز تهیه شده باشد، متن فارسی اولویت خواهد داشت.</div>

            <div class=' font-black mt-[40px] mt-40'>ماده سیزده – قانون حاکم</div>
            <div>این قرارداد از هر حیث تابع قوانین و مقررات جمهوری اسلامی ایران می‌باشد.</div>
            <div>تبصره: این قرارداد در ایران منعقد شدهو کلیه آثار و اکام و قوانین حاکم بر آن منجمله صلاحیت محاکم قانون کشور ایران خواهد شود.</div>

            <div class='font-black mt-[40px] mt-40 mb-3'>ماده چهاردهم – تاخیر در ایفای تعهدات قابل جمع با وجه التزام</div>
            <table class='table-activity mb-6'>
                <tbody>
                <tr>
                    <th class='!px-[20px] px-20 !pl-[45px] pl-45 text-13'>جریمه هر روز تاخیر</th>
                    <td class='!px-[30px]'>$daily_fine تومان</td>
                </tr>
                <tr>
                    <th class='!px-[20px] !pl-[45px] px-20 pl-45 text-13'>حداکثر زمان تاخیر تا شروع جریمه</th>
                    <td class='!px-[30px]'>$fine_after_day روز</td>
                </tr>
                <tr>
                    <th class='!px-[20px] !pl-[45px] px-20 pl-45 text-13'>مبلغ جریمه پس از گذشت زمان تاخیر</th>
                    <td class='!px-[30px]'>$fine_after_price تومان</td>
                </tr>
                <tr>
                    <th class='!px-[20px] !pl-[45px] px-20 pl-45 text-13'>نمره منفی پس از گذشت حداکثر زمان تاخیر</th>
                    <td class='!px-[30px]'>$fine_after_negative نمره</td>
                </tr>
                </tbody>
            </table>
            <div>
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>14-1- چنانچه مشاور نتواند در زمان مقرر در قرارداد به تعهدات خود عمل نماید و یا انجام تعهدات موضوع قرارداد با تأخیر مواجه گردد، جریمـه‌ای معادل یک و نیم درصد ( 5/1 % ) مبلغ قرارداد به ازاء هر روز تأخیر تا سقف 20 % مبلغ قرارداد محاسبه و از محل مطالبـات و تضامین مشاور کسر خواهد شد.</div>
                    <div style='margin: 4px 0;'>14-2- هیچگونه تأخیری در انجام کار مورد قبول كارفرما نیست و مشاور موظف است مراحل انجام شرح كار را طوری تنظیم نماید که از هرگونه توقفی جلوگیری بعمل آورد. بدیهی است كه هرگونه ناهماهنگی كه منجر به تأخیر در تحویل كار شود مشمول جریمه خواهد بود.</div>
                    <div style='margin: 4px 0;'>14-3- تعیین جرائم مقرر در این ماده نافی تعهدات مشاور در پرداخت سایر جرایم قانونی و قراردادی نبوده و کارفرما برحسب صلاحدید نسبت به تجمیع کلیه جرایم و اخذ آن اقدام می نماید.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده پانزده - منع مداخله در معاملات دولتی</div>
            <div >مشاور رسماً اعلام می نماید که مشمول ممنوعیت مذکور در قانون منع مداخله در معاملات دولتی مصوبه دی ماه 1337 نمی‌باشد و هیچ یک از اشخاص یا افرادی که مشمول قانون مذکور می‌باشند را در منافع این قرارداد شریک ننموده است و تعهد نموده که تا پایان اجرای قرارداد مفاد قانون مزبور را کماکان مراعات نماید. در صورت تخلف از مراتب فوق کارفرما حق خواهد داشت طبق مقررات قانون مزبور با مشاور رفتار نماید.</div>

            <div class=' font-black mt-[40px] mt-40'>ماده شانزده - واسطه معاملات و ارتشاء</div>
            <div >مشاور تعهد می نماید که در رابطه با انعقاد و اجرای این قرارداد واسطه ای وجود نداشته و حق دلالی یا کمیسیون یا حق العمل یا پاداش یا تحفه و هدیه یا رشوه و یا نظیر آن را بصورت نقدی، جنسی، ارائه خدمات و سهیم کردن در منافع خود و یا هر طریق دیگری نپرداخته و چنانچه خلاف این مطلب به نحوی از انحاء معلوم شود، کارفرما حق خواهد داشت قرارداد را مطابق با ماده 21 فسخ نموده و بدون سپری نمودن تشریفات قضایی جبران خسارات و هزینه های وارده با واسطه و بلاواسطه را از محل کلیه مطالبات و تضامین مشاور بعمل آورد و مشاور را به مقامات ذیصلاح معرفی نماید.</div>

            <div class=' font-black mt-[40px] mt-40 style='margin: 4px 0;''>ماده هفده – منع تبانی و رعایت اصول حرفه ای</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>17-1- مشاور در انجام موضوع این قرارداد و مسایل مربوط به آن متعهد می‌گردد هیچ گونه تبانی، ارتباط و یا همکاری خارج از ترتیبات قراردادی، تعهدات قانونی و عرف جاری با پرسنل کارفرما، پیمانکاران و سایر نفرات ذی ربط به طور مستقیم یا غیر مستقیم نداشته باشد.</div>
                    <div style='margin: 4px 0;'>17-2- مشاور موظف به رعایت اصول حرفه ای و اخلاقی توسط خود و پرسنل و کلیه افراد شاغل در اجرای تعهدات این قرارداد می‌باشد.</div>
                    <div style='margin: 4px 0;'>17-3- در صورت احراز تخطی از مراتب بندهای فوق و اثبات تخلف مشاور و عدم رعایت اصول حرفه ای و اخلاقی، کلیه مسئولیت های حقوقی و قانونی متوجه وی بوده و کارفرما ضمن فسخ قرارداد می تواند بدون سپری نمودن تشریفات قضایی جبران خسارات و هزینه های وارده با واسطه و بلاواسطه را از محل کلیه مطالبات یا تضامین مشاور از جمله شامل و نه محدود به تضمین انجام تعهدات بعمل آورد.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده هجده – حل اختلاف</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>18-1- در صورت بروز هر گونه اختلافی فیمابین طرفین در خصوص این قرارداد، موضوع اختلاف ابتداء از طریق مذاكره با حضور نمایندگان طرفین بررسی و حل و فصل خواهد شد و در صورت عدم حصول نتیجه مطلوب ظرف مدت دو ماه، موضوع اختلاف به کارشناس مرضی الطرفین ارجاع و چنانچه توافق حاصل نشد موضوع اختلاف از طریق مراجعه به مراجع قضائی و دادگاه های عمومی و حقوقی تهران حل و فصل خواهد شد.</div>
                    <div style='margin: 4px 0;'>18-2- در صورت تصمیم بر ارجاع موضوع اختلاف به کارشناس مرضی الطرفین، طرفین موظفند ظرف یک هفته از پایان مهلت دو ماهه مذاکره، کارشناس مرضی الطرفین را انتخاب نمایند و در صورت عدم حصول توافق، هر یک از طرفین می تواند به مراجع قضایی تهران مراجعه نماید.</div>
                    <div style='margin: 4px 0;'>18-3- در صورت ارجاع اختلاف به کارشناس مرضی الطرفین، وی موظف است نظر خود را ظرف دو هفته از تاریخ ارجاع اعلام نماید و در صورت اتمام مدت مذکور هر یک از طرفین می تواند به مراجع قضایی تهران مراجعه نماید.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده نوزده – موارد فورس ماژور</div>
            <div >اگر به عللی خارج از حیطه اختیار و اراده طرفین انجام تمام یا قسمتی از تعهدات موضوع این قرارداد امکان پذیر نباشد، مادامی که جهات مزبور ادامه دارد، عدم انجام تعهداتی که متأثر از عوامل غیرمترقبه باشد، تخلف از قرارداد محسوب نمی‌ شود.</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>19-1- نظر کارفرما در خصوص موارد مشمول فورس ماژور ملاک عمل خواهد بود.</div>
                    <div style='margin: 4px 0;'>19-2- هیچیك از طرفین قرارداد در مورد این ماده نمیتوانند ادعایی منجمله دریافت خسارت به دلیل توقف، خاتمه و یا تأخیر اجرای تعهدات بر علیه دیگری داشته باشند. هیچگونه تعدیلی ناشی از حادثه قهریه به قرارداد تعلق نمی‌گیرد.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده بیست – تعلیق</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>20-1- كارفرما می تواند با اعلام كتبی 10 (ده) روزه به مشاور در حین انجام خدمات، تمام یا بخشی از خدمات موضوع قرارداد را، طی نامه ای كه تاریخ شروع و خاتمه تعلیق در آن معین شده است، به حالت تعلیق درآورد.</div>
                    <div style='margin: 4px 0;'>20-2- تعلیق خدمات از سوی كارفرما، حداكثر ٤ ماه خواهد بود. در مدت تعلیق 4 ماهه هیچگونه هزینه ای به مشاور پرداخت نمی‌گردد.</div>
                    <div style='margin: 4px 0;'>20-3- در صورتی كه تمدید تعلیق ضرورت داشته باشد، كارفرما موضوع را به صورت کتبی به مشاور اعلام میكند، هیچگونه هزینه ای بابت تمدید تعلیق به مشاور پرداخت نمی‌گردد.</div>
                    <div style='margin: 4px 0;'>20-4- مشاور موظف است پس از شروع تعلیق، خدمات مربوطه را متوقف كند و حداكثر ظرف مدت 15 (پانزده) روز، گزارش وضعیت خدمات را تا هنــگام اعلام تعلیق، تهیه و به كارفرما تسلیم نماید.</div>
                    <div style='margin: 4px 0;'>20-5- چنانـچه در دوران تعلــیق، كارفرما تصمیــم به لــغو تعلــــیق بــگیــرد، مـــوضــوع را به مشاور اعلام می كند. در این صورت حداكثر 10 (ده) روز پس از اعلام، كار ادامــه می‌یابد.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده بیست و یک – فسخ قرارداد</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>21-1- كارفرما می‌تواند در صورت تحقق هریک از موارد زیر، قرارداد را به صوت جزئی و یا کلی فسخ نماید و خسارات وارده را از محل تضامین و مطالبات مشاور بدون نیاز به تشریفات قضایی كسر نماید؛</div>
                    <div class='pr-[40px] pr-40'>
                        <div>21-1-1- انحلال یا ورشکستگی مشاور.</div>
                        <div>21-1-2- تأخیر در شروع به کار بیش از یک هفته از تاریخ ابلاغ قرارداد.</div>
                        <div>21-1-3- تأخیر در انجام تعهدات توسط مشاور.</div>
                        <div>21-1-4- در صورت قصور و مسامحه در اجرای قرارداد و در نتیجه احراز عدم توانایی مشاور جهت ایفای تعهدات مندرج در قرارداد بنا به تشخیص کارفرما.</div>
                        <div>21-1-5- انتقال یا واگذاری تمام یا بخشی از موضوع قرارداد به غیر بدون مجوز کتبی کارفرما. (بند 7-1)</div>
                        <div>21-1-6- تبانی، ارتباط و یا هرگونه همکاری خارج از ترتیبات قراردادی، تعهدات قانونی و عرف جاری با پرسنل کارفرما، مشاوران و سایر نفرات ذی ربط به طور مستقیم یا غیر مستقیم.</div>
                        <div>21-1-7- وجود واسطه و ارتشاء و یا تسری و شمول هرگونه ممنوعیت قانونی به مشاور.</div>
                    </div>
                    <div style='margin: 4px 0;'>21-2- نظر کارفرما در خصوص قصور یا عدم قصور مشاور در انجام موضوع قرارداد، ملاک عمل خواهد بود و مشاور حق اعتراض نخواهد داشت.</div>
                    <div style='margin: 4px 0;'>21-3- کارفرما اختیار دارد ضمن فسخ قرارداد ناشی از بندهای فوق نسبت به جبران کلیه خسارت وارده به اضافه 10% (ده درصد) از محل تضامین و مطالبات مشاور اقدام نماید و مشاور حق اعتراض نخواهد داشت.</div>
                    <div style='margin: 4px 0;'>21-4- زمان فسخ قرارداد، تاریخ ارسال نامه فسخ به ایمیل مشاور و یا ارسال نامه از طریق پست پیشتاز به آدرس رسمی مشاور مندرج در قرارداد خواهد بود.</div>
                    <div style='margin: 4px 0;'>21-5- نظر کارفرما در خصوص میزان خسارات وارده، ملاک عمل خواهد بود و مشاور حق اعتراض نخواهد داشت.</div>
                    <div style='margin: 4px 0;'>21-6- در صورت فسخ قرارداد توسط کارفرما، مشاور موظف است ظرف هفت روز کاری از تاریخ فسخ قرارداد، نسبت به ارائه صورت وضعیت کلیه فعالیت های انجام شده (مطابق شرح کار قرارداد) اقدام نماید و کارفرما ظرف 14 روز کاری از تاریخ دریافت نسخه اصل صورت وضعیت، نسبت به بررسی و اعلام نظر اقدام خواهد نمود. نظر کارفرما در خصوص صورت وضعیت و میزان کارهای صورت گرفته قطعی و ملاک عمل خواهد بود.</div>
                </div>
            </div>

            <div class=' font-black mt-[40px] mt-40'>ماده بیست و دو – خاتمه قرارداد</div>
            <div >کارفرما می تواند در هر زمان و بنا به صلاحدید خود نسبت به ابلاغ خاتمه قرارداد اقدام نموده و در صورتیکه ابلاغ خاتمه قرارداد ناشی از قصور مشاور نباشد، کارفرما نسبت به محاسبه و پرداخت حق الزحمه مشاور تا تاریخ خاتمه اقدام می نماید.</div>
            <div >
                <div class='pr-3 flex flex-col gap-2'>
                    <div style='margin: 4px 0;'>22-1- زمان خاتمه قرارداد، تاریخ ارسال نامه خاتمه قرارداد به ایمیل مشاور یا ارسال نامه از طریق پست پیشتاز به آدرس رسمی مشاور مندرج در قرارداد، خواهد بود.</div>
                    <div style='margin: 4px 0;'>22-2- در صورت خاتمه قرارداد توسط کارفرما، مشاور موظف است ظرف هفت روز کاری از تاریخ خاتمه قرارداد، نسبت به ارائه صورت وضعیت کلیه فعالیت های انجام شده (مطابق شرح کار قرارداد) اقدام نماید و کارفرما ظرف 14 روز کاری از تاریخ دریافت نسخه اصل صورت وضعیت، نسبت به بررسی و اعلام نظر اقدام خواهد نمود. نظر کارفرما در خصوص صورت وضعیت و میزان کارهای صورت گرفته قطعی و ملاک عمل خواهد بود.</div>
                </div>
            </div>


            <div class=' font-black mt-[40px] mt-40'>ماده بیست و سه – اقامتگاه طرفین</div>
            <div >اﻗﺎﻣﺘﮕﺎه ﻃﺮﻓﯿﻦ ﺑﻪ ﺷﺮح زﯾﺮ ﻣﯽ ﺑﺎﺷﺪ، ﻫﺮ ﮔﻮﻧﻪ ﻣﮑﺎﺗﺒﻪ، اﺑﻼﻏﯿﻪ و غیره (اعم از نشانی پستی، پست الکترونیک (ایمیل) و دورنگار) ﺑﻪ ﻧﺸﺎﻧﯽ ﻫﺎی ذﯾﻞ اﺑﻼغ ﺷﺪه ﺗﻠﻘﯽ ﻣﯽ ﮔﺮدد، در ﺻﻮرت ﺗﻐﯿﯿﺮ هر کدام ﺿﺮوری اﺳﺖ ﻣﺮاﺗﺐ را ﮐﺘﺒﺎً اﻋﻼم، در ﻏﯿﺮ اﯾﻦ ﺻﻮرت ارﺳﺎل ﻣﮑﺎﺗﺒﺎت ﺑﻪ ﻧﺸﺎﻧﯽ ﻫﺎی ﻣﺸﺮوﺣﻪ زﯾﺮ اﺑﻼغ ﺷﺪه ﻣﺤﺴﻮب ﻣﯽ ﮔﺮدد:</div>
            <div ><strong>کارفرما:</strong> ﺗﻬﺮان – محله اراج – خیابان گلشن – خیابان شهید مصباح (گلزار) - پلاک 27 - ﮐﺪﭘﺴﺘﯽ : 1693938611</div>
            <div ><strong>مشاور:</strong> $address </div>
            <div ><strong>کدپستی:</strong> $postal_code </div>
            <div class='font-semibold mb-4' style='margin-bottom: 16px'><strong>تلفن:</strong> $home_phone </div>
            <div >در ﺻﻮرﺗﯽ ﮐﻪ ﯾﮑﯽ از دو ﻃﺮف، ﻣﺤﻞ ﻗﺎﻧﻮﻧﯽ ﺧﻮد را ﺗﻐﯿﯿﺮ دﻫﺪ، ﺑﺎﯾﺪ ﻧﺸﺎﻧﯽ ﺟﺪﯾﺪ ﺧﻮد را دﺳﺖ ﮐﻢ ﭘﺎﻧﺰده (15) روز ﭘﯿﺶ از ﺗﺎرﯾﺦ ﺗﻐﯿﯿﺮ، ﺑﻪ ﻃﺮف دﯾﮕﺮ اﻃﻼع دﻫﺪ. ﺗﺎ وﻗﺘﯽ ﮐﻪ ﻧﺸﺎﻧﯽ ﺟﺪﯾﺪ ﺑﻪ ﻃﺮف دﯾﮕﺮ اﻋﻼم ﻧﺸﺪه اﺳﺖ، ﻣﮑﺎﺗﺒﺎت ﺑﻪ ﻧﺸﺎﻧﯽ ﻗﺒﻠﯽ ارﺳﺎل ﻣﯽ‌ﺷﻮد و درﯾﺎﻓﺖ ﺷﺪه ﺗﻠﻘﯽ ﻣﯽ ﮔﺮدد.</div>

            <div class=' font-black mt-[40px] mt-40'> ماده بیست و چهار – نسخ قرارداد</div>
            <div >این قرارداد در 24 (بیست و چهار) ماده و 2 نسخه تهیه شده که هر نسخه حکم واحد داشته و یک نسخه از آن به مشاور ابلاغ شده است.</div>
        </body>
        ";

        return $Contract;
    }
}
